STMicroelectronics/STM32CubeMP13/Projects/STM32MP135C-DK/Applications/ThreadX/Tx_MPU/STM32CubeIDE/Tx_ModuleManager_A7/mmu_stm32mp13xx_azurertos.c
/**
  ******************************************************************************
  * @file         mmu_for_threadx.c
  * @brief        MMU support for ThreadX Module Manager
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  ******************************************************************************
  *                                                                        *
  *       Copyright (c) Microsoft Corporation. All rights reserved.        *
  *                                                                        *
  *       This software is licensed under the Microsoft Software License   *
  *       Terms for Microsoft Azure RTOS. Full text of the license can be  *
  *       found in the LICENSE file at https://aka.ms/AzureRTOS_EULA       *
  *       and in the root directory of this software.                      *
  *                                                                        *
  *****************************************************************************
*/

#include "txm_module.h"

#ifdef TXM_MODULE_MEMORY_PROTECTION_ENABLED

#include "mmu_stm32mp13xx_azurertos.h"
#include "stm32mp13xx.h"
#include <stdio.h>

extern char __TEXT_START__; // Start of code section
extern char __TEXT_END__; // End of code section (4096 bytes aligned)
extern char __RO_START__; // Start of data read-only section
extern char __RO_END__; // End of RO section (4096 bytes aligned)
extern char __RW_START__; // Start of data read/write section
extern char __RW_END__; // End of data read/write section (4096 bytes aligned)

/*********************************************************************************
 * Page tables.
 *********************************************************************************/
#define LEVEL1_PAGES __attribute__ ((aligned(16384), section(".mmu")))
#define LEVEL2_PAGES __attribute__ ((aligned(1024), section(".mmu")))

/*-------------------------------------------------------------------------------
 * Specific page tables.
 *-------------------------------------------------------------------------------*/
static LEVEL2_PAGES uint32_t mmu_level2_page_table_SYSRAM[TXM_LEVEL_2_PAGE_TABLE_ENTRIES];
static LEVEL2_PAGES uint32_t mmu_level2_page_table_SRAM[TXM_LEVEL_2_PAGE_TABLE_ENTRIES];
static LEVEL2_PAGES uint32_t mmu_level2_page_table_GIC[TXM_LEVEL_2_PAGE_TABLE_ENTRIES];

/*-------------------------------------------------------------------------------
 * ThreadX page tables (from txm_module_manager_mm_initialize.c).
 *-------------------------------------------------------------------------------*/
/* ASID table, index is ASID number and contents hold pointer to module.  */
TXM_MODULE_INSTANCE *_txm_asid_table[TXM_ASID_TABLE_LENGTH];

/* Master page table, 2^14 (16kB) alignment.
 * First table is the master level 1 table, the rest are for each module. */
LEVEL1_PAGES ULONG _txm_ttbr1_page_table[TXM_MAXIMUM_MODULES][TXM_MASTER_PAGE_TABLE_ENTRIES];

/* Module start and end level 2 page tables, 2^10 (1kB) alignment.
 * First set of 4 tables are the master level 2 tables, the rest are for each module.
 * Each module needs two L2 tables for code and two L2 tables for data. */
LEVEL2_PAGES ULONG _txm_level2_module_page_table[TXM_MAXIMUM_MODULES * 4][TXM_LEVEL_2_PAGE_TABLE_ENTRIES];

/* Module external memory level 2 page tables, 2^10 (1kB) alignment. */
LEVEL2_PAGES ULONG _txm_level2_external_page_pool[TXM_LEVEL2_EXTERNAL_POOL_PAGES][TXM_LEVEL_2_PAGE_TABLE_ENTRIES];

/*********************************************************************************
 * Section and page descriptors.
 *********************************************************************************/
static uint32_t Sect_Periph_SO; // strongly ordered, shareable, non-executable, rw
static uint32_t Sect_Device_R; // device, non-shareable, non-executable, ro
static uint32_t Sect_Device_RW; // device, non-shareable, non-executable, rw
static uint32_t Sect_Kernel_RW; // global, outer & inner wb/wa, shareable, non-executable, rw
static uint32_t Sect_Kernel_Data_R; // global, outer & inner wb/wa, shareable, non-executable, ro
static uint32_t Sect_Kernel_Data_RW; // global, outer & inner wb/wa, shareable, non-executable, rw
static uint32_t Sect_Kernel_Code; // global, outer & inner wb/wa, shareable, executable, ro
static uint32_t Sect_User_Data_R; // non-global, outer & inner wb/wa, shareable, non-executable, ro
static uint32_t Sect_User_Data_RW; // non-global, outer & inner wb/wa, shareable, non-executable, rw
static uint32_t Sect_User_Code; // non-global, outer & inner wb/wa, shareable, executable, ro

static uint32_t Page_L1_4k; // generic
static uint32_t Page_4k_Device_RW; // global, device, shareable, non-executable, rw
static uint32_t Page_4k_SRAM_RW; // global, non-cacheable, shareable, non-executable, rw
static uint32_t Page_4k_Kernel_Data_R; // global, outer & inner wb/wa, shareable, non-executable, ro
static uint32_t Page_4k_Kernel_Data_RW; // global, outer & inner wb/wa, shareable, non-executable, rw
static uint32_t Page_4k_Kernel_Code; // global, outer & inner wb/wa, shareable, executable, ro
static uint32_t Page_4k_User_Data_R; // non-global, outer & inner wb/wa, shareable, non-executable, ro
static uint32_t Page_4k_User_Data_RW; // non-global, outer & inner wb/wa, shareable, non-executable, rw
static uint32_t Page_4k_User_Code; // non-global, outer & inner wb/wa, shareable, executable, ro

typedef int (*mmu_canModifyLevel2TableType)(TXM_MODULE_INSTANCE *module, uint32_t *ttbl2);
typedef uint32_t* (*mmu_allocateLevel2TableType)(TXM_MODULE_INSTANCE *module);

static int mmu_setupPages(uint32_t s, uint32_t e, uint32_t *ttbl1, uint32_t descl1section, uint32_t descl1, uint32_t descl2, mmu_canModifyLevel2TableType canModifyLevel2Table, mmu_allocateLevel2TableType allocateTable, TXM_MODULE_INSTANCE *module)
{
  uint32_t sectionShift = 20, sectionSize = 0x1UL << sectionShift, sectionMask = sectionSize - 1, sectionEnd;
  uint32_t pageShift = 12, pageSize = 0x1UL << pageShift, pageMask = pageSize - 1, pageCount;
  uint32_t descl1Current, *ttbl2Current, *ttbl2;
  s = s & ~pageMask; /* Round down the start address its page start. */
  e = (e + pageMask) & ~pageMask; /* Round up the end address to its page end. */
  do
  {
    sectionEnd = (s + sectionSize) & ~sectionMask;
    if (sectionEnd > e)
    {
      sectionEnd = e;
    }

    if (((s | sectionEnd) & sectionMask) == 0)
    {
      /* Both start and end are section aligned, we can use a full section, we do not need a level 2 table. */

