STMicroelectronics/STM32CubeMP13/Projects/STM32MP135C-DK/Applications/ThreadX/Tx_MPU/STM32CubeIDE/Tx_ModuleManager_A7/mmu_stm32mp13xx_azurertos.c
      MMU_TTSection(ttbl1, s, 1, descl1section);
    }
    else
    {
      /* Only a part of a section is used, we need the level 2 table. */

      descl1Current = ttbl1[s >> sectionShift];
      if (descl1Current & PAGE_L1_DESCRIPTOR)
      {
        /* There is already an L2 table, try to use it. */
        ttbl2Current = (uint32_t*)(descl1Current & 0xFFFFFC00);
        if (!canModifyLevel2Table(module, ttbl2Current))
        {
          /* We cannot modify this level 2 table, allocate a new one and copy the original into it. */
          ttbl2 = allocateTable(module);
          if (!ttbl2)
          {
            /* We run out of L2 tables. */
            return 1;
          }

          /* Copy the original table to the new one. */
          memcpy(ttbl2, ttbl2Current, TXM_LEVEL_2_PAGE_TABLE_ENTRIES * sizeof(uint32_t));

          ttbl2Current = ttbl2;
        }
      }
      else
      {
        /* No L2 table is currently used for this section, use a new one. */

        /* Check if there is still an L2 table available. */
        ttbl2 = allocateTable(module);
        if (!ttbl2)
        {
          /* We run out of L2 tables. */
          return 1;
        }

        ttbl2Current = ttbl2;
      }

      pageCount = (sectionEnd - s) / pageSize;
      MMU_TTPage4k(ttbl1, s, pageCount, descl1, ttbl2Current, descl2);
    }

    s = sectionEnd;
  } while (s < e);

  return 0;
}

/*********************************************************************************
 * Target specific page setup.
 *********************************************************************************/
static int mmu_canModifyLevel2Table(TXM_MODULE_INSTANCE *module, uint32_t *ttbl2)
{
  ULONG asid;
  if (!module)
  {
    return 1;
  }
  asid = module->txm_module_instance_asid;
  if (
      (ttbl2 >= _txm_level2_module_page_table[asid * 4] && ttbl2 < _txm_level2_module_page_table[asid * 4 + 4]) ||
      (ttbl2 >= _txm_level2_external_page_pool[0] && ttbl2 < _txm_level2_external_page_pool[TXM_LEVEL2_EXTERNAL_POOL_PAGES])
      )
  {
    return 1;
  }
  return 0;
}

static uint32_t* mmu_allocateLevel2TableInternal(TXM_MODULE_INSTANCE *module)
{
  ULONG asid = module ? module->txm_module_instance_asid : 0;
  uint32_t* ttbl2 = (uint32_t*)_txm_level2_module_page_table[asid * 4];
  int tableIndex;
  for (tableIndex = 0; tableIndex < 4; tableIndex++)
  {
    if (ttbl2[0] == 0)
    {
      return ttbl2;
    }
    ttbl2 += TXM_LEVEL_2_PAGE_TABLE_ENTRIES;
  }
  return NULL;
}

static uint32_t* mmu_allocateLevel2TableExternal(TXM_MODULE_INSTANCE *module)
{
  uint32_t *table = NULL;
  INT table_index = -1, pool_index = -1, i;

  /* Find first free table slot in module control block. */
  for (i = 0; i < TXM_MODULE_LEVEL2_EXTERNAL_PAGES; i++)
  {
    if (module->txm_external_page_table[i] == TX_NULL)
    {
      table_index = i;
      break;
    }
  }
  if (table_index >= 0)
  {
    /* Find first free table in pool. */
    for (i = 0; i < TXM_LEVEL2_EXTERNAL_POOL_PAGES; i++)
    {
      if (_txm_level2_external_page_pool[i][0] == (ULONG) TX_NULL)
      {
        pool_index = i;
        break;
      }
    }
  }
  if (table_index >= 0 && pool_index >= 0)
  {
    table = _txm_level2_external_page_pool[pool_index];
    module->txm_external_page_table[table_index] = (ULONG*)table;
    memset(table, 0, TXM_LEVEL_2_PAGE_TABLE_ENTRIES * sizeof(ULONG));
  }

  return table;
}

static int mmu_initialize_target()
{
  mmu_region_attributes_Type region;
  uint32_t *ttbl1 = (uint32_t*) _txm_ttbr1_page_table[TXM_MASTER_PAGE_TABLE_INDEX], *ttbl2;
  int shared = 0; /* Set to 1 to enable sharing. Sharing is not needed on a MP1 since there is only one care. Also this can cause performance issues. */
  int codeWritable = 1; /* Set to 1 to allow write access for code pages. This may be necessary for debugging. */

   /* Create faulting entries for full 4GB address space to ensure any access to incorrect memory location will be trapped
      Further sections and pages setup will overwrite these default table entries. */
  MMU_TTSection(ttbl1, 0, TXM_MASTER_PAGE_TABLE_ENTRIES, DESCRIPTOR_FAULT);

  /* Clear all Level 2 tables, this also set all pages as faulting by default. */
  memset(_txm_level2_module_page_table, 0, sizeof(_txm_level2_module_page_table));
  memset(_txm_level2_external_page_pool, 0, sizeof(_txm_level2_external_page_pool));
  memset(mmu_level2_page_table_SYSRAM, 0, sizeof(mmu_level2_page_table_SYSRAM));
  memset(mmu_level2_page_table_SRAM, 0, sizeof(mmu_level2_page_table_SRAM));
  memset(mmu_level2_page_table_GIC, 0, sizeof(mmu_level2_page_table_GIC));

  /*****************************************
   * Generate descriptors. Refer to core_ca.h to get information about attributes
   *****************************************/
  /* Common to all descriptors. */
  region.domain = 0x0;
  region.e_t = ECC_DISABLED;

  /* Warning: MMU_GetSectionDescriptor() and MMU_GetPageDescriptor() call MMU_APSection() and MMU_APPage() with afe=1, so that all combinations of priv_t and user_t are not supported.
     For non supported combinations, this results in no access for both privileged and user mode. */

  /*----------------------------------------
   * Section descriptors
   *----------------------------------------*/
  /* Common to all sections. */
  region.rg_t = SECTION;

  /*
   * Peripheral, device, and kernel sections.
   */

  /* Common to all peripheral, device and kernel sections. */
  region.g_t = GLOBAL;

  /* Common to peripheral and device sections. */
  region.inner_norm_t = NON_CACHEABLE;
  region.outer_norm_t = NON_CACHEABLE;
  region.mem_t = STRONGLY_ORDERED;
  region.sec_t = SECURE;
  region.xn_t = NON_EXECUTE;
#if 0
  /* Temporarily enabled for debugging. */
  region.user_t = RW;
#else
  region.user_t = NO_ACCESS;
#endif
  /* Peripheral strongly ordered section. */
  region.priv_t = RW;
  region.sh_t = shared ? SHARED : NON_SHARED;
  MMU_GetSectionDescriptor(&Sect_Periph_SO, region);
  /* Device strongly ordered read only section. */
  region.priv_t = READ;
  region.sh_t = NON_SHARED; // Never shared.
  MMU_GetSectionDescriptor(&Sect_Device_R, region);
  /* Device strongly ordered read only section. */
  region.priv_t = RW;
  region.sh_t = NON_SHARED; // Never shared.
  MMU_GetSectionDescriptor(&Sect_Device_RW, region);

  /* Common to kernel sections. */
  region.inner_norm_t = WB_WA;
  region.outer_norm_t = WB_WA;
  region.mem_t = NORMAL;
  region.sec_t = SECURE;
  region.sh_t = shared ? SHARED : NON_SHARED;
  /* Common to kernel data sections. */
  region.xn_t = NON_EXECUTE;
  region.user_t = NO_ACCESS;
  /* Kernel read-write section. */
  region.priv_t = RW;
  MMU_GetSectionDescriptor(&Sect_Kernel_RW, region);
  /* Kernel data read only section. */
  region.priv_t = READ;
  MMU_GetSectionDescriptor(&Sect_Kernel_Data_R, region);
  /* Kernel data read-write section. */
  region.priv_t = RW;
  MMU_GetSectionDescriptor(&Sect_Kernel_Data_RW, region);
  /* Kernel code section. */
  region.xn_t = EXECUTE;
  region.priv_t = codeWritable ? RW : READ; /* This should be read-only but the debugger is not able to step in a read-only code section. */
  region.user_t = codeWritable ? RW : READ; /* Necessary for ThreadX module calls. */
  MMU_GetSectionDescriptor(&Sect_Kernel_Code, region);

