STMicroelectronics/STM32CubeMP13/Projects/STM32MP135C-DK/Applications/ThreadX/Tx_MPU/STM32CubeIDE/Tx_ModuleManager_A7/mmu_stm32mp13xx_azurertos.c
  /*
   * User sections.
   */
  /* Common to all user sections. */
  region.g_t = NON_GLOBAL;
  region.inner_norm_t = WB_WA;
  region.outer_norm_t = WB_WA;
  region.mem_t = NORMAL;
  region.sec_t = SECURE;
  region.sh_t = shared ? SHARED : NON_SHARED;
  /* User data read only section. */
  region.xn_t = NON_EXECUTE;
  region.priv_t = READ;
  region.user_t = READ;
  MMU_GetSectionDescriptor(&Sect_User_Data_R, region);
  /* User data read-write section. */
  region.xn_t = NON_EXECUTE;
  region.priv_t = RW;
  region.user_t = RW;
  MMU_GetSectionDescriptor(&Sect_User_Data_RW, region);
  /* User code section. */
  region.xn_t = EXECUTE;
  region.priv_t = codeWritable ? RW : READ; /* This should be read-only but the debugger is not able to step in a read-only code section. */
  region.user_t = codeWritable ? RW : READ; /* This should be read-only but the debugger is not able to step in a read-only code section. */
  MMU_GetSectionDescriptor(&Sect_User_Code, region);

  /*----------------------------------------
   * Page descriptors
   *----------------------------------------*/
  /* Common to all pages. */
  region.rg_t = PAGE_4k;

  /*
   * Kernel pages.
   */

  /* Common to all peripheral, device and kernel pages. */
  region.g_t = GLOBAL;

  /* Common to device and SRAM pages. */
  region.inner_norm_t = NON_CACHEABLE;
  region.outer_norm_t = NON_CACHEABLE;
  region.sec_t = SECURE;
  region.user_t = NO_ACCESS;
  /* Device read-write page. */
  region.mem_t = SHARED_DEVICE;
  region.xn_t = NON_EXECUTE;
  region.priv_t = RW;
  region.sh_t = NON_SHARED; /* Never shared. */
  MMU_GetPageDescriptor(&Page_L1_4k, &Page_4k_Device_RW, region);
  /* SRAM read-write, executable, non-cacheable page. */
  region.mem_t = NORMAL;
  region.xn_t = EXECUTE;
  region.priv_t = RW;
  region.sh_t = shared ? SHARED : NON_SHARED;
  MMU_GetPageDescriptor(&Page_L1_4k, &Page_4k_SRAM_RW, region);

  /* Common to kernel pages. */
  region.inner_norm_t = WB_WA;
  region.outer_norm_t = WB_WA;
  region.mem_t = NORMAL;
  region.sec_t = SECURE;
  region.sh_t = shared ? SHARED : NON_SHARED;
  /* Common to kernel data pages. */
  region.xn_t = NON_EXECUTE;
  region.user_t = NO_ACCESS;
  /* Kernel data read only page. */
  region.priv_t = READ;
  MMU_GetPageDescriptor(&Page_L1_4k, &Page_4k_Kernel_Data_R, region);
  /* Kernel data read-write page. */
  region.priv_t = RW;
  MMU_GetPageDescriptor(&Page_L1_4k, &Page_4k_Kernel_Data_RW, region);
  /* Kernel code page. */
  region.xn_t = EXECUTE;
  region.priv_t = codeWritable ? RW : READ; /* This should be read-only but the debugger is not able to step in a read-only code section. */
  region.user_t = codeWritable ? RW : READ; /* Necessary for ThreadX module calls. */
  MMU_GetPageDescriptor(&Page_L1_4k, &Page_4k_Kernel_Code, region);

  /*
   * User pages.
   */

  /* Common to all user pages. */
  region.g_t = NON_GLOBAL;
  region.inner_norm_t = WB_WA;
  region.outer_norm_t = WB_WA;
  region.mem_t = NORMAL;
  region.sec_t = SECURE;
  region.sh_t = shared ? SHARED : NON_SHARED;
  /* User data read only page. */
  region.xn_t = NON_EXECUTE;
  region.priv_t = READ;
  region.user_t = READ;
  MMU_GetPageDescriptor(&Page_L1_4k, &Page_4k_User_Data_R, region);
  /* User data read-write page. */
  region.xn_t = NON_EXECUTE;
  region.priv_t = RW;
  region.user_t = RW;
  MMU_GetPageDescriptor(&Page_L1_4k, &Page_4k_User_Data_RW, region);
  /* User code page. */
  region.xn_t = EXECUTE;
  region.priv_t = codeWritable ? RW : READ; /* This should be read-only but the debugger is not able to step in a read-only code section. */
  region.user_t = codeWritable ? RW : READ; /* This should be read-only but the debugger is not able to step in a read-only code section. */
  MMU_GetPageDescriptor(&Page_L1_4k, &Page_4k_User_Code, region);

  /*****************************************
   * Generate page tables.
   *****************************************/
  /*
   * Device specific areas.
   */
  // Define 256M FMC NOR memory as device, non-shareable, non-executable, ro
  MMU_TTSection(ttbl1, (uint32_t) AXI_BUS_MEMORY_BASE, ((QSPI_MEM_BASE - AXI_BUS_MEMORY_BASE) >> 20), Sect_Device_R);
  // Define 256 QSPI memory as device, non-shareable, non-executable, ro
  MMU_TTSection(ttbl1, (uint32_t) QSPI_MEM_BASE, ((FMC_NAND_MEM_BASE - QSPI_MEM_BASE) >> 20), Sect_Device_R);
  // Define 256M FMC NAND memory as device, non-shareable, non-executable, ro
  MMU_TTSection(ttbl1, (uint32_t) FMC_NAND_MEM_BASE, 256U, Sect_Device_RW);

  /*
   * DDR area.
   */
  // All DDR (1GB) non-executable (except code pages), cacheable, rw
  MMU_TTSection(ttbl1, (uint32_t) DRAM_MEM_BASE, 1024U, Sect_Kernel_RW);

  /*
   * SYSRAM area.
   */
  ttbl2 = mmu_level2_page_table_SYSRAM;
  // Create (256 * 4k)=1MB faulting entries to cover SYSRAM 1M aligned range
  MMU_TTPage4k(ttbl1, SYSRAM_BASE & 0xFFF00000, 1024U / 4U, Page_L1_4k, ttbl2, DESCRIPTOR_FAULT);
  // Create (32 * 4k)=128k RW non-executable entries to cover full SYSRAM
  MMU_TTPage4k(ttbl1, SYSRAM_BASE, 128U / 4U, Page_L1_4k, ttbl2, Page_4k_SRAM_RW);

  /*
   * SRAM area.
   */
  ttbl2 = mmu_level2_page_table_SRAM;
  // Create (256 * 4k)=1MB faulting entries to cover SRAM 1M aligned range
  MMU_TTPage4k(ttbl1, AHB_SRAM & 0xFFF00000, 1024U / 4U, Page_L1_4k, ttbl2, DESCRIPTOR_FAULT);
  // Create (8 * 4k)=32k Normal entries to cover full SRAM
  MMU_TTPage4k(ttbl1, AHB_SRAM, 32U / 4U, Page_L1_4k, ttbl2, Page_4k_SRAM_RW);

  /*
   * Peripherals.
   */
  // Define peripheral memory as strongly ordered, shareable, read/write, non cacheable
  MMU_TTSection(ttbl1, (uint32_t) PERIPH_BASE, ((AXI_BUS_MEMORY_BASE - PERIPH_BASE) >> 20), Sect_Periph_SO);

  /*
   * GIC.
   */
  ttbl2 = mmu_level2_page_table_GIC;
  // Create (256 * 4k)=1MB faulting entries to cover GIC 1M aligned range
  MMU_TTPage4k(ttbl1, GIC_BASE & 0xFFF00000, 1024U / 4U, Page_L1_4k, ttbl2, DESCRIPTOR_FAULT);
  // Create (7 * 4k)=28k Device entries to cover full GIC
  MMU_TTPage4k(ttbl1, GIC_BASE, 28U / 4U, Page_L1_4k, ttbl2, Page_4k_Device_RW);

