STMicroelectronics/STM32CubeMP13/Projects/STM32MP135C-DK/Applications/ThreadX/Tx_MPU/STM32CubeIDE/Tx_ModuleManager_A7/mmu_stm32mp13xx_azurertos.c
  /*
   * Code and data.
   */
  ttbl2 = _txm_level2_module_page_table[TXM_MASTER_PAGE_TABLE_INDEX];
  // Create normal, executable and read-only (read/write in reality for debugging) entries to cover code
  if (mmu_setupPages((uint32_t) &__TEXT_START__, (uint32_t) &__TEXT_END__, ttbl1, Sect_Kernel_Code, Page_L1_4k, Page_4k_Kernel_Code, mmu_canModifyLevel2Table, mmu_allocateLevel2TableInternal, NULL))
  {
    printf("Cannot setup application text pages.\n");
    return 1;
  }
  // Create normal, non-executable and read-only entries to cover read-only data
  if (mmu_setupPages((uint32_t) &__RO_START__, (uint32_t) &__RO_END__, ttbl1, Sect_Kernel_Data_R, Page_L1_4k, Page_4k_Kernel_Data_R, mmu_canModifyLevel2Table, mmu_allocateLevel2TableInternal, NULL))
  {
    printf("Cannot setup application read-only pages.\n");
    return 1;
  }
  // Create normal, non-executable and read/write entries to cover writable data
  if (mmu_setupPages((uint32_t) &__RW_START__, (uint32_t) &__RW_END__, ttbl1, Sect_Kernel_Data_RW, Page_L1_4k, Page_4k_Kernel_Data_RW, mmu_canModifyLevel2Table, mmu_allocateLevel2TableInternal, NULL))
  {
    printf("Cannot setup application read/write pages.\n");
    return 1;
  }
  // The remaining 4 KB pages of the 1 MB section must also be initialized, otherwise there will be a crash when accessing this area (because of heap allocation).
  if (mmu_setupPages((uint32_t) &__RW_END__, ((uint32_t) &__RW_END__ + 0x100000UL) & ~(0x100000UL - 1), ttbl1, Sect_Kernel_Data_RW, Page_L1_4k, Page_4k_Kernel_Data_RW, mmu_canModifyLevel2Table, mmu_allocateLevel2TableInternal, NULL))
  {
    printf("Cannot setup application read/write pages.\n");
    return 1;
  }

  return 0;
}

/*********************************************************************************
 * MMU initialization.
 *********************************************************************************/
static void mmu_clearAsidTable()
{
  UINT i;
  for (i = 0; i < TXM_ASID_TABLE_LENGTH; i++)
  {
    _txm_asid_table[i] = 0;
  }
  _txm_asid_table[0] = (TXM_MODULE_INSTANCE*) TXM_ASID_RESERVED;
}

static void mmu_clearAsid()
{
  ULONG cp15reg = 0;
  __asm volatile ("mcr p15, 0, %0, c13, c0, 1" : : "r"(cp15reg) : );
  __ISB();
}

/* Set the domain to client mode. */
static void mmu_setClientMode()
{
  __set_DACR(DACR_Dn_CLIENT << DACR_D_Pos_(0));
  __ISB();
}

static void mmu_setLevel1PageTable(ULONG *pageTable)
{
  /* Set location of level 1 page table in TTBR
   ; 31:14 - Translation table base addr (31:14-TTBCR.N, TTBCR.N is 0 out of reset)
   ; 13:7  - 0x0
   ; 6     - IRGN[0] (Inner WB WA)
   ; 5     - NOS     (Non-shared)
   ; 4:3   - RGN     (Outer WB WA)
   ; 2     - IMP     (Implementation Defined)
   ; 1     - S       (Non-shared)
   ; 0     - IRGN[1] (Inner WB WA) */
  __set_TTBR0((uint32_t)pageTable | 0x9U);
  __ISB();
}

int mmu_initialize()
{
  /* Disable MMU. */
  MMU_Disable();

  mmu_clearAsidTable();
  mmu_clearAsid();
  mmu_setLevel1PageTable(_txm_ttbr1_page_table[TXM_MASTER_PAGE_TABLE_INDEX]);
  mmu_setClientMode();
  if (mmu_initialize_target())
  {
    printf("Cannot initialize target MMU.");
    return 1;
  }

  /* Clean and invalidate caches */
  L1C_CleanInvalidateDCacheAll();
  L1C_InvalidateICacheAll();
  L1C_InvalidateBTAC();
  MMU_InvalidateTLB();

  /* Enables MMU, simplified access permissions model and access flag. */
  MMU_Enable();

  return 0;
}

/*********************************************************************************
 * ThreadX MMU functions.
 *********************************************************************************/

/*-------------------------------------------------------------------------------
 * From txm_module_manager_mm_register_setup.c.
 *-------------------------------------------------------------------------------*/
/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    _txm_module_manager_inside_data_check           Cortex-A7/MMU/GNU   */
/*                                                           6.x          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Scott Larson, Microsoft Corporation                                 */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function determines if pointer is within the module's data or  */
/*    shared memory.                                                      */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    pointer                           Data pointer                      */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    Completion Status                                                   */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    TXM_MODULE_MANAGER_DATA_POINTER_CHECK                               */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  xx-xx-xxxx      Scott Larson            Initial Version 6.x           */
/*                                                                        */
/**************************************************************************/
UINT _txm_module_manager_inside_data_check(ULONG pointer)
{
  ULONG translation;

  /* ATS1CUR operation on address supplied in pointer, Stage 1 unprivileged read. */
  __asm volatile ("MCR p15, 0, %0, c7, c8, 2" : : "r"(pointer) : );
  __asm volatile ("ISB");
  /* Ensure completion of the MCR write to CP15. */
  __asm volatile ("MRC p15, 0, %0, c7, c4, 0" : "=r"(translation) : : );
  /* Read result from 32-bit PAR into translation. */
  if (translation & TXM_ADDRESS_TRANSLATION_FAULT_BIT)
  {
    return (TX_FALSE);
  }

