STMicroelectronics/STM32CubeMP13/Projects/STM32MP135C-DK/Applications/ThreadX/Tx_MPU/STM32CubeIDE/Tx_ModuleManager_A7/mmu_stm32mp13xx_azurertos.c
  return (TX_TRUE);
}

/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    _txm_module_manager_assign_asid                 Cortex-A7/MMU/GNU   */
/*                                                           6.x          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Scott Larson, Microsoft Corporation                                 */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function assigns an Application Specific ID (ASID) to a        */
/*    module.                                                             */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    module_instance                   Pointer to module instance        */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    Completion Status                                                   */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    _txm_module_manager_mm_register_setup                               */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  xx-xx-xxxx      Scott Larson            Initial Version 6.x           */
/*                                                                        */
/**************************************************************************/
UINT _txm_module_manager_assign_asid(TXM_MODULE_INSTANCE *module_instance)
{
  UINT i = 1;

  /* Find first non-zero ASID, starting at index 1. */
  while (i < TXM_ASID_TABLE_LENGTH)
  {
    if (_txm_asid_table[i] != 0)
    {
      i++;
    }
    else
    {
      module_instance->txm_module_instance_asid = i;
      _txm_asid_table[i] = module_instance;
      return (TX_SUCCESS);
    }
  }

  return (TXM_MODULE_ASID_ERROR);
}

/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    _txm_module_manager_remove_asid                 Cortex-A7/MMU/GNU   */
/*                                                           6.x          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Scott Larson, Microsoft Corporation                                 */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function removes a module from the ASID list.                  */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    module_instance                   Pointer to module instance        */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    TXM_MODULE_MANAGER_MODULE_UNLOAD                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  xx-xx-xxxx      Scott Larson            Initial Version 6.x           */
/*                                                                        */
/**************************************************************************/
VOID _txm_module_manager_remove_asid(TXM_MODULE_INSTANCE *module_instance)
{
  if (module_instance->txm_module_instance_asid)
  {
    _txm_asid_table[module_instance->txm_module_instance_asid] = 0;
  }
}

/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    _txm_module_manager_mm_register_setup           Cortex-A7/MMU/GNU   */
/*                                                           6.x          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Scott Larson, Microsoft Corporation                                 */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function sets up the Cortex-A7 MMU register definitions based  */
/*    on the module's memory characteristics.                             */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    module_instance                   Pointer to module instance        */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    _txm_module_manager_assign_asid                                     */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    TXM_MODULE_MANAGER_MODULE_SETUP                                     */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  xx-xx-xxxx      Scott Larson            Initial Version 6.x           */
/*                                                                        */
/**************************************************************************/
VOID _txm_module_manager_mm_register_setup(TXM_MODULE_INSTANCE *module)
{
  ULONG asid;
  uint32_t *ttbl1, *ttbl1Master, *ttbl2;
  uint32_t codeStart, codeEnd, dataStart, dataEnd;

  /* Assign an ASID to this module. */
  _txm_module_manager_assign_asid(module);
  asid = module->txm_module_instance_asid;

  /* Copy master level 1 page table to module's page table. */
  ttbl1 = (uint32_t *)_txm_ttbr1_page_table[asid];
  ttbl1Master = (uint32_t *)_txm_ttbr1_page_table[TXM_MASTER_PAGE_TABLE_INDEX];
  memcpy(ttbl1, ttbl1Master, TXM_MASTER_PAGE_TABLE_ENTRIES * sizeof(uint32_t));
  /* Clear level 2 tables. This makes each page as a fault page. */
  ttbl2 = (uint32_t *)_txm_level2_module_page_table[asid * 4];
  memset(ttbl2, 0, TXM_LEVEL_2_PAGE_TABLE_ENTRIES * 4 * sizeof(ULONG));

  /* Get code start and end addresses. */
  codeStart = (uint32_t) module->txm_module_instance_code_start;
  /* Extend end address to end of page (TXM_MODULE_MEMORY_ALIGNMENT-1). */
  codeEnd = ((((uint32_t) module->txm_module_instance_code_end) + TXM_MODULE_MEMORY_ALIGNMENT - 1) & ~((uint32_t) TXM_MODULE_MEMORY_ALIGNMENT - 1)) - 1;

  /* Get relocatable data start and end addresses. */
  dataStart = (uint32_t) module->txm_module_instance_data_start;
  /* Extend end address to end of page (TXM_MODULE_MEMORY_ALIGNMENT-1). */
  dataEnd = ((((uint32_t) module->txm_module_instance_data_end) + TXM_MODULE_MEMORY_ALIGNMENT - 1) & ~((uint32_t) TXM_MODULE_MEMORY_ALIGNMENT - 1)) - 1;

  // Create normal, executable and read-only (read/write in reality for debugging) entries to cover code.
  if (mmu_setupPages(codeStart, codeEnd, ttbl1, Sect_User_Code, Page_L1_4k, Page_4k_User_Code, mmu_canModifyLevel2Table, mmu_allocateLevel2TableInternal, module))
  {
    printf("Cannot setup module code pages.\n");
    assert(0);
  }
  // Create normal, non-executable and read/write entries to cover writable data.
  if (mmu_setupPages(dataStart, dataEnd, ttbl1, Sect_User_Data_RW, Page_L1_4k, Page_4k_User_Data_RW, mmu_canModifyLevel2Table, mmu_allocateLevel2TableInternal, module))
  {
    printf("Cannot setup module data pages.\n");
    assert(0);
  }

  // Ensure the module code has been written to main memory so that the instruction cache sees it.
#if !defined(NO_CACHE_USE)
  L1C_CleanInvalidateDCacheAll();
  L1C_InvalidateICacheAll();
  L1C_InvalidateBTAC();
#endif
}

/*-------------------------------------------------------------------------------
 * From txm_module_manager_external_memory_enable.c.
 *-------------------------------------------------------------------------------*/
/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    _txm_level2_page_clear                          Cortex-A7/MMU/GNU   */
/*                                                           6.x          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Scott Larson, Microsoft Corporation                                 */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function clears the first entry in a L2 page table and clears  */
/*    the table entry from the module external page table list.           */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    module_instance                       Module instance pointer       */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    None                                                                */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    TXM_MODULE_MANAGER_MODULE_UNLOAD                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  xx-xx-xxxx      Scott Larson            Initial Version 6.x           */
/*                                                                        */
/**************************************************************************/
VOID _txm_level2_page_clear(TXM_MODULE_INSTANCE *module_instance)
{
  UINT i;
  for (i = 0; i < TXM_MODULE_LEVEL2_EXTERNAL_PAGES; i++)
  {
    if (module_instance->txm_external_page_table[i])
    {
      *(ULONG *)module_instance->txm_external_page_table[i] = (ULONG)TX_NULL;
      module_instance->txm_external_page_table[i] = TX_NULL;
    }
  }
}

/**************************************************************************/
/*                                                                        */
/*  FUNCTION                                               RELEASE        */
/*                                                                        */
/*    _txm_module_manager_external_memory_enable      Cortex-A7/MMU/GNU   */
/*                                                           6.x          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Scott Larson, Microsoft Corporation                                 */
/*                                                                        */
/*  DESCRIPTION                                                           */
/*                                                                        */
/*    This function creates an entry in the MMU table for a shared        */
/*    memory space.                                                       */
/*                                                                        */
/*  INPUT                                                                 */
/*                                                                        */
/*    module                                Module instance pointer       */
/*    start_address                         Start address of memory       */
/*    length                                Length of external memory     */
/*    attributes                            Memory attributes             */
/*                                                                        */
/*  OUTPUT                                                                */
/*                                                                        */
/*    Completion Status                                                   */
/*                                                                        */
/*  CALLS                                                                 */
/*                                                                        */
/*    _tx_mutex_get                         Get protection mutex          */
/*    _tx_mutex_put                         Release protection mutex      */
/*    TX_MEMSET                             Fill memory with constant     */
/*    _txm_level2_page_get                  Get L2 page table             */
/*                                                                        */
/*  CALLED BY                                                             */
/*                                                                        */
/*    Application code                                                    */
/*                                                                        */
/*  RELEASE HISTORY                                                       */
/*                                                                        */
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  xx-xx-xxxx      Scott Larson            Initial Version 6.x           */
/*                                                                        */
/**************************************************************************/
UINT _txm_module_manager_external_memory_enable(TXM_MODULE_INSTANCE *module,
    VOID *start_address,
    ULONG length,
    UINT attributes)
{
  mmu_region_attributes_Type region;
  uint32_t *ttbl1, sectionDesc, pageDesc;
  uint32_t areaStart = (uint32_t)start_address, areaEnd = (uint32_t)(start_address + length);
  ULONG asid;

