STMicroelectronics/STM32CubeMP13/Projects/STM32MP135C-DK/Applications/ThreadX/Tx_MPU/STM32CubeIDE/Tx_ModuleManager_A7/mmu_stm32mp13xx_azurertos.c
  /* Determine if the module manager has not been initialized yet.  */
  if (_txm_module_manager_ready != TX_TRUE)
  {
    /* Module manager has not been initialized.  */
    return(TX_NOT_AVAILABLE);
  }

  /* Determine if the module is valid. */
  if (module == TX_NULL)
  {
    /* Invalid module pointer. */
    return(TX_PTR_ERROR);
  }

  /* Get module manager protection mutex. */
  _tx_mutex_get(&_txm_module_manager_mutex, TX_WAIT_FOREVER);

  /* Determine if the module instance is valid.  */
  if (module -> txm_module_instance_id != TXM_MODULE_ID)
  {
    /* Release the protection mutex. */
    _tx_mutex_put(&_txm_module_manager_mutex);

    /* Invalid module pointer. */
    return(TX_PTR_ERROR);
  }

  /* Determine if the module instance is in the loaded state. */
  if (module -> txm_module_instance_state != TXM_MODULE_LOADED)
  {
    /* Release the protection mutex. */
    _tx_mutex_put(&_txm_module_manager_mutex);

    /* Return error if the module is not ready. */
    return(TX_START_ERROR);
  }

  /* Determine if the module instance is memory protected. */
  if (module -> txm_module_instance_asid == 0)
  {
    /* Release the protection mutex. */
    _tx_mutex_put(&_txm_module_manager_mutex);

    /* Return error if the module is not protected. */
    return(TXM_MODULE_EXTERNAL_MEMORY_ENABLE_ERROR);
  }

  /* Start address must be aligned to MMU block size (4 kB).
     Length will be rounded up to 4 kB alignment. */
  if (areaStart & (TXM_MODULE_MEMORY_ALIGNMENT - 1))
  {
    /* Release the protection mutex. */
    _tx_mutex_put(&_txm_module_manager_mutex);

    /* Return alignment error. */
    return(TXM_MODULE_ALIGNMENT_ERROR);
  }

  asid = module -> txm_module_instance_asid;

  /* Page tables. */
  ttbl1 = (uint32_t *)_txm_ttbr1_page_table[asid];

  /* Create page entries. */
  if (attributes == mmu_peripheral)
  {
    memset(&region, 0, sizeof(region));
    region.mem_t = STRONGLY_ORDERED;
    region.domain = 0;
    region.inner_norm_t = NON_CACHEABLE;
    region.outer_norm_t = NON_CACHEABLE;
    region.e_t = ECC_DISABLED;
    region.xn_t = NON_EXECUTE;
    region.g_t = NON_GLOBAL;
    region.sec_t = SECURE;
    region.priv_t = RW;
    region.user_t = RW;
    region.sh_t = SHARED; // shared ? SHARED : NON_SHARED;

    region.rg_t = SECTION;
    MMU_GetSectionDescriptor(&sectionDesc, region);
    region.rg_t = PAGE_4k;
    MMU_GetPageDescriptor(&Page_L1_4k, &pageDesc, region);
  }
  else
  {
    sectionDesc = attributes == mmu_readWrite ? Sect_User_Data_RW : Sect_User_Data_R;
    pageDesc = attributes == mmu_readWrite ? Page_4k_User_Data_RW : Page_4k_User_Data_R;
  }
  if (mmu_setupPages(areaStart, areaEnd, ttbl1, sectionDesc, Page_L1_4k, pageDesc, mmu_canModifyLevel2Table, mmu_allocateLevel2TableExternal, module))
  {
    /* Release the protection mutex. */
    _tx_mutex_put(&_txm_module_manager_mutex);

    /* Return external memory enable. */
    return(TXM_MODULE_EXTERNAL_MEMORY_ENABLE_ERROR);
  }

  L1C_CleanInvalidateDCacheAll();
  L1C_InvalidateICacheAll();
  L1C_InvalidateBTAC();
  MMU_InvalidateTLB();

  /* Release the protection mutex. */
  _tx_mutex_put(&_txm_module_manager_mutex);

  return(TX_SUCCESS);
}

#endif
